<?php
    class UsersModel {
        // Метод для получения списка пользователей
        public function getUsers() {
            // Запрос к базе данных или другим источникам данных для получения списка пользователей
            return ['User 1', 'User 2', 'User 3'];
        }
        
        // Метод для добавления пользователя
        public function addUser($user) {
            // Добавление пользователя в базу данных или другой источник данных
        }
        
        // Метод для удаления пользователя
        public function deleteUser($user) {
            // Удаление пользователя из базы данных или другого источника данных
        }
    }
?>